OpenNuvoton/M55M1BSP/SampleCode/StdDriver/HSUSBH_USBH_VCOM_MassStorage/main.c
/**************************************************************************//**
 * @file     main.c
 * @version  V1.00
 * @brief    This sample uses a command-shell-like interface to demonstrate
 *           how to use USBH mass storage driver and make it working as a disk
 *           driver under FATFS file system. It also demonstrates how to use
 *           CDC driver to connect a CDC class VCOM device.
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
 ****************************************************************************/

#include <stdio.h>
#include <string.h>
#include "NuMicro.h"


#include "usbh_lib.h"
#include "usbh_cdc.h"

#include "diskio.h"
#include "msc.h"
#include "ff.h"

#define USE_USB_APLL1_CLOCK         1
#define BUFF_SIZE                   (4*1024)

static UINT blen = BUFF_SIZE;
DWORD acc_size;                         /* Work register for fs command */
WORD acc_files, acc_dirs;
FILINFO Finfo;

extern MSC_T  *g_msc_list;

char Line[256];                         /* Console input buffer */
#if _USE_LFN
    char Lfname[512];
#endif

#ifdef __ICCARM__
    #pragma data_alignment=32
    BYTE Buff_Pool[BUFF_SIZE] ;       /* Working buffer */
    BYTE Buff_Pool2[BUFF_SIZE] ;      /* Working buffer 2 */
#else
    BYTE Buff_Pool[BUFF_SIZE] __attribute__((aligned(32)));       /* Working buffer */
    BYTE Buff_Pool2[BUFF_SIZE] __attribute__((aligned(32)));      /* Working buffer 2 */
#endif

BYTE  *Buff;
BYTE  *Buff2;

#ifdef __ICCARM__
    #pragma data_alignment=4
    uint8_t  buff1[BUFF_SIZE] ;       /* Working buffer */
    uint8_t  buff2[BUFF_SIZE] ;       /* Working buffer */
#else
    uint8_t  buff1[BUFF_SIZE] __attribute__((aligned(4)));       /* Working buffer */
    uint8_t  buff2[BUFF_SIZE] __attribute__((aligned(4)));       /* Working buffer */
#endif

int kbhit(void)
{
    return !((DEBUG_PORT->FIFOSTS & UART_FIFOSTS_RXEMPTY_Msk) == 0);
}

volatile int  int_in_cnt, int_out_cnt, iso_in_cnt, iso_out_cnt;

volatile uint32_t  g_tick_cnt;
uint32_t           g_t0;

volatile int  int_cnt = 0;

NVT_ITCM void SysTick_Handler(void)
{
    g_tick_cnt++;
}

void enable_sys_tick(int ticks_per_second)
{
    g_tick_cnt = 0;

    if (SysTick_Config(SystemCoreClock / ticks_per_second))
    {
        /* Setup SysTick Timer for 1 second interrupts  */
        printf("Set system tick error!!\n");

        while (1);
    }
}

uint32_t get_ticks()
{
    return g_tick_cnt;
}

void timer_init()
{
    g_t0 = get_ticks();
}

uint32_t get_timer_value()
{
    return (get_ticks() - g_t0);
}

/*
 *  This function is necessary for USB Host library.
 */
void delay_us(int usec)
{
    /*
     *  Configure Timer0, clock source from HIRC_12M. Prescale 12
     */
    /* TIMER0 clock from HIRC */
    CLK_SetModuleClock(TMR0_MODULE, CLK_TMRSEL_TMR0SEL_HIRC, 0);
    CLK_EnableModuleClock(TMR0_MODULE);

    TIMER_SET_PRESCALE_VALUE(TIMER0, (12 - 1));
    /* stop timer0 */
    TIMER_Stop(TIMER0);
    /* write 1 to clear for safety */
    TIMER_ClearIntFlag(TIMER0);
    TIMER_ClearWakeupFlag(TIMER0);
    /* set timer cmp value */
    TIMER_SET_CMP_VALUE(TIMER0, usec);
    /* Timer0 config to oneshot mode */
    TIMER_SET_OPMODE(TIMER0, TIMER_ONESHOT_MODE);
    /* start timer0*/
    TIMER_Start(TIMER0);

    while (TIMER_GetIntFlag(TIMER0) == 0);
}

void  dump_buff_hex(uint8_t *pucBuff, int nBytes)
{
    int     nIdx, i;

    nIdx = 0;

    while (nBytes > 0)
    {
        printf("0x%04X  ", nIdx);

        for (i = 0; (i < 16) && (nBytes > 0); i++)
        {
            printf("%02x ", pucBuff[nIdx + i]);
            nBytes--;
        }

        nIdx += 16;
        printf("\n");
    }

    printf("\n");
}
/*--------------------------------------------------------------------------*/
/* VCOM Init/ Show information /Callback function                           */

/*--------------------------------------------------------------------------*/
static char s_achLine[64];             /* Console input buffer */
static volatile int s_i8RxReady = 0;

void vcom_status_callback(CDC_DEV_T *cdev, uint8_t *pu8RData, int u8DataLen);
void vcom_rx_callback(CDC_DEV_T *cdev, uint8_t *pu8RData, int u8DataLen);
void show_line_coding(LINE_CODING_T *lc);
int init_cdc_device(CDC_DEV_T *cdev);
/* VCOM function list                                                       */
void  vcom_status_callback(CDC_DEV_T *cdev, uint8_t *pu8RData, int u8DataLen)
{
    int i8Cnt;

    (void)cdev;

    printf("[VCOM STS] ");

    for (i8Cnt = 0; i8Cnt < u8DataLen; i8Cnt++)
        printf("0x%02x ", pu8RData[i8Cnt]);

    printf("\n");
}

void  vcom_rx_callback(CDC_DEV_T *cdev, uint8_t *pu8RData, int u8DataLen)
{
    int i8Cnt;

    (void)cdev;

    //printf("[VCOM DATA %d] ", u8DataLen);
    for (i8Cnt = 0; i8Cnt < u8DataLen; i8Cnt++)
    {
        //printf("0x%02x ", pu8RData[i8Cnt]);
        printf("%c", pu8RData[i8Cnt]);
    }

    //printf("\n");

    s_i8RxReady = 1;
}

void show_line_coding(LINE_CODING_T *lc)
{
    printf("[CDC device line coding]\n");
    printf("====================================\n");
    printf("Baud rate:  %d bps\n", lc->baud);
    printf("Parity:     ");

    switch (lc->parity)
    {
        case 0:
            printf("None\n");
            break;

        case 1:
            printf("Odd\n");
            break;

        case 2:
            printf("Even\n");
            break;

        case 3:
            printf("Mark\n");
            break;

        case 4:
            printf("Space\n");
            break;

        default:
            printf("Invalid!\n");
            break;
    }

    printf("Data Bits:  ");

    switch (lc->data_bits)
    {
        case 5 :
        case 6 :
        case 7 :
        case 8 :
        case 16:
            printf("%d\n", lc->data_bits);
            break;

        default:
            printf("Invalid!\n");
            break;
    }

    printf("Stop Bits:  %s\n\n", (lc->stop_bits == 0) ? "1" : ((lc->stop_bits == 1) ? "1.5" : "2"));
}

