OpenNuvoton/M55M1BSP/SampleCode/StdDriver/HSUSBH_USBH_VCOM_MassStorage/main.c
            cdev = usbh_cdc_get_device_list();

            if (cdev == NULL)
                continue;

            while (cdev != NULL)
            {
                init_cdc_device(cdev);

                if (cdev != NULL)
                    cdev = cdev->next;
            }
        }

        cdev = usbh_cdc_get_device_list();

        if (cdev == NULL)
            continue;

        if (cdev != NULL)
        {
            if (s_i8RxReady)
            {
                s_i8RxReady = 0;

                if (cdev->rx_busy == 0)
                    usbh_cdc_start_to_receive_data(cdev, vcom_rx_callback);
            }

            /*
             *  Check user input and send to CDC device immediately
             *  (You can also modify it send multiple characters at one time.)
             */
            if (kbhit() == 0)
            {
                s_achLine[0] = (char)getchar();
#if (NVT_DCACHE_ON == 1)
                //for DCACHE On using.
                i8Ret = usbh_dcache_cdc_send_data(cdev, (uint8_t *)s_achLine, 1);
#else
                i8Ret = usbh_cdc_send_data(cdev, (uint8_t *)s_achLine, 1);
#endif

                if (i8Ret != 0)
                    printf("\n!! Send data failed, 0x%x!\n", i8Ret);
            }
        }

        //MSC Process loop..
        if (g_msc_list != NULL)
        {
            printf(_T(">"));
            ptr = Line;

            get_line(ptr, sizeof(Line));

            switch (*ptr++)
            {

                case 'q' :  /* Exit program */
                    return 0;

                case '5':
                    for (sector_no = 0; sector_no < 128000; sector_no++)
                    {
                        if (sector_no % 1000 == 0)
                            printf("\nLBK transfer count: Ii:%d, Io: %d, Si:%d, So:%d\n", int_in_cnt, int_out_cnt, iso_in_cnt, iso_out_cnt);

                        printf("Test sector %d\r", sector_no);

                        memset(buff1, 87, 512);
                        memset(buff2, 0x87, 512);

                        res = (FRESULT)disk_read(3, buff1, sector_no, 1);

                        if (res)
                        {
                            printf("read failed at %d, rc=%d\n", sector_no, (WORD)res);
                            put_rc(res);
                            break;
                        }

                        res = (FRESULT)disk_read(3, buff2, sector_no, 1);

                        if (res)
                        {
                            printf("read failed at %d, rc=%d\n", sector_no, (WORD)res);
                            put_rc(res);
                            break;
                        }

                        if (memcmp(buff1, buff2, 512) != 0)
                        {
                            printf("\nData compare failed!!\n");
                            break;
                        }
                    }

                    break;

                case '4' :
                case '6' :
                case '7' :
                    ptr--;
                    *(ptr + 1) = ':';
                    *(ptr + 2) = 0;
                    put_rc(f_chdrive((TCHAR *)ptr));
                    break;

                case 'd' :
                    switch (*ptr++)
                    {
                        case 'd' :  /* dd [<lba>] - Dump sector */
                            if (!xatoi(&ptr, &p2)) p2 = sect;

                            res = (FRESULT)disk_read(3, Buff, p2, 1);

                            if (res)
                            {
                                printf("rc=%d\n", (WORD)res);
                                break;
                            }

                            sect = p2 + 1;
                            printf("Sector:%d\n", (INT)p2);

                            for (buf = (unsigned char *)Buff, ofs = 0; ofs < 0x200; buf += 16, ofs += 16)
                                put_dump(buf, ofs, 16);

                            break;

                        case 't' :  /* dt - raw sector read/write performance test */
                            printf("Raw sector read performance test...\n");
                            timer_init();

                            for (s1 = 0; s1 < (0x800000 / BUFF_SIZE); s1++)
                            {
                                s2 = BUFF_SIZE / 512;   /* sector count for each read  */
                                res = (FRESULT)disk_read(3, Buff, 10000 + s1 * s2, s2);

                                if (res)
                                {
                                    printf("read failed at %d, rc=%d\n", 10000 + s1 * s2, (WORD)res);
                                    put_rc(res);
                                    break;
                                }

                                if (s1 % 256 == 0)
                                    printf("%d KB\n", (s1 * BUFF_SIZE) / 1024);
                            }

                            p1 = get_timer_value();
                            printf("time = %d.%02d\n", (INT)(p1 / 100), (INT)(p1 % 100));
                            printf("Raw read speed: %d KB/s\n", (INT)(((0x800000 * 100) / p1) / 1024));

                            printf("Raw sector write performance test...\n");
                            timer_init();

                            for (s1 = 0; s1 < (0x800000 / BUFF_SIZE); s1++)
                            {
                                s2 = BUFF_SIZE / 512;   /* sector count for each read  */
                                res = (FRESULT)disk_write(3, Buff, 20000 + s1 * s2, s2);

                                if (res)
                                {
                                    printf("write failed at %d, rc=%d\n", 20000 + s1 * s2, (WORD)res);
                                    put_rc(res);
                                    break;
                                }

                                if (s1 % 256 == 0)
                                    printf("%d KB\n", (s1 * BUFF_SIZE) / 1024);
                            }

                            p1 = get_timer_value();
                            printf("time = %d.%02d\n", (INT)(p1 / 100), (INT)(p1 % 100));
                            printf("Raw write speed: %d KB/s\n", (INT)(((0x800000 * 100) / p1) / 1024));
                            break;

