OpenNuvoton/M55M1BSP/SampleCode/StdDriver/HSUSBH_USBH_VCOM_MassStorage/main.c
                        case 'z' :  /* dz - file read/write performance test */
#if 1
                            printf("File write performance test...\n");
                            res = f_open(&file1, "3:\\tfile", FA_CREATE_ALWAYS | FA_WRITE);

                            if (res)
                            {
                                put_rc(res);
                                break;
                            }

                            timer_init();

                            for (s1 = 0; s1 < (0x800000 / BUFF_SIZE); s1++)
                            {
                                res = f_write(&file1, Buff, BUFF_SIZE, &cnt);

                                if (res || (cnt != BUFF_SIZE))
                                {
                                    put_rc(res);
                                    break;
                                }

                                if (s1 % 128 == 0)
                                    printf("%d KB\n", (s1 * BUFF_SIZE) / 1024);
                            }

                            p1 = get_timer_value();
                            f_close(&file1);
                            printf("time = %d.%02d\n", (INT)p1 / 100, (INT)p1 % 100);
                            printf("File write speed: %d KB/s\n", (INT)((0x800000 * 100) / p1) / 1024);
#endif
                            printf("File read performance test...\n");
                            res = f_open(&file1, "3:\\tfile", FA_READ);

                            if (res)
                            {
                                put_rc(res);
                                break;
                            }

                            timer_init();

                            for (s1 = 0; s1 < (0x800000 / BUFF_SIZE); s1++)
                            {
                                res = f_read(&file1, Buff, BUFF_SIZE, &cnt);

                                if (res || (cnt != BUFF_SIZE))
                                {
                                    put_rc(res);
                                    break;
                                }

                                if (s1 % 128 == 0)
                                    printf("%d KB\n", (s1 * BUFF_SIZE) / 1024);
                            }

                            p1 = get_timer_value();
                            f_close(&file1);
                            printf("time = %d.%02d\n", (INT)(p1 / 100), (INT)(p1 % 100));
                            printf("File read speed: %d KB/s\n", (INT)(((0x800000 * 100) / p1) / 1024));
                            break;
                    }

                    break;

                case 'b' :
                    switch (*ptr++)
                    {
                        case 'd' :  /* bd <addr> - Dump R/W buffer */
                            if (!xatoi(&ptr, &p1)) break;

                            for (ptr = (char *)&Buff[p1], ofs = p1, cnt = 32; cnt; cnt--, ptr += 16, ofs += 16)
                                put_dump((BYTE *)ptr, ofs, 16);

                            break;

                        case 'e' :  /* be <addr> [<data>] ... - Edit R/W buffer */
                            if (!xatoi(&ptr, &p1)) break;

                            if (xatoi(&ptr, &p2))
                            {
                                do
                                {
                                    Buff[p1++] = (BYTE)p2;
                                } while (xatoi(&ptr, &p2));

                                break;
                            }

                            for (;;)
                            {
                                printf("%04X %02X-", (WORD)p1, Buff[p1]);
                                get_line(Line, sizeof(Line));
                                ptr = Line;

                                if (*ptr == '.') break;

                                if (*ptr < ' ')
                                {
                                    p1++;
                                    continue;
                                }

                                if (xatoi(&ptr, &p2))
                                    Buff[p1++] = (BYTE)p2;
                                else
                                    printf("???\n");
                            }

                            break;

                        case 'r' :  /* br <sector> [<n>] - Read disk into R/W buffer */
                            if (!xatoi(&ptr, &p2)) break;

                            if (!xatoi(&ptr, &p3)) p3 = 1;

                            printf("rc=%d\n", disk_read(3, Buff, p2, p3));
                            break;

                        case 'w' :  /* bw <sector> [<n>] - Write R/W buffer into disk */
                            if (!xatoi(&ptr, &p2)) break;

                            if (!xatoi(&ptr, &p3)) p3 = 1;

                            printf("rc=%d\n", disk_write(3, Buff, p2, p3));
                            break;

                        case 'f' :  /* bf <n> - Fill working buffer */
                            if (!xatoi(&ptr, &p1)) break;

                            memset(Buff, (int)p1, BUFF_SIZE);
                            break;

                    }

                    break;



                case 'f' :
                    switch (*ptr++)
                    {

                        case 's' :  /* fs - Show logical drive status */
                            res = f_getfree("", (DWORD *)&p2, &fs);

                            if (res)
                            {
                                put_rc(res);
                                break;
                            }

                            printf("FAT type = FAT%d\nBytes/Cluster = %d\nNumber of FATs = %d\n"
                                   "Root DIR entries = %d\nSectors/FAT = %d\nNumber of clusters = %d\n"
                                   "FAT start (lba) = %d\nDIR start (lba,clustor) = %d\nData start (lba) = %d\n\n...",
                                   ft[fs->fs_type & 3], (INT)(fs->csize * 512UL), fs->n_fats,
                                   fs->n_rootdir, (INT)(fs->fsize), (INT)(fs->n_fatent - 2),
                                   (INT)(fs->fatbase), (INT)(fs->dirbase), (INT)(fs->database)
                                  );
                            acc_size = acc_files = acc_dirs = 0;
#if _USE_LFN
                            Finfo.lfname = Lfname;
                            Finfo.lfsize = sizeof(Lfname);
#endif
                            res = scan_files(ptr);

