OpenNuvoton/M55M1BSP/SampleCode/StdDriver/HSUSBH_USBH_VCOM_MassStorage/main.c
                            if (res)
                            {
                                put_rc(res);
                                break;
                            }

                            printf("\r%d files, %d bytes.\n%d folders.\n"
                                   "%d KB total disk space.\n%d KB available.\n",
                                   acc_files, (INT)(acc_size), acc_dirs,
                                   (INT)((fs->n_fatent - 2) * (fs->csize / 2)), (INT)(p2 * (fs->csize / 2))
                                  );
                            break;

                        case 'l' :  /* fl [<path>] - Directory listing */
                            while (*ptr == ' ') ptr++;

                            res = f_opendir(&dir, ptr);

                            if (res)
                            {
                                put_rc(res);
                                break;
                            }

                            p1 = s1 = s2 = 0;

                            for (;;)
                            {
                                res = f_readdir(&dir, &Finfo);

                                if ((res != FR_OK) || !Finfo.fname[0]) break;

                                if (Finfo.fattrib & AM_DIR)
                                {
                                    s2++;
                                }
                                else
                                {
                                    s1++;
                                    p1 += Finfo.fsize;
                                }

                                printf("%c%c%c%c%c %d/%02d/%02d %02d:%02d    %9d  %s",
                                       (Finfo.fattrib & AM_DIR) ? 'D' : '-',
                                       (Finfo.fattrib & AM_RDO) ? 'R' : '-',
                                       (Finfo.fattrib & AM_HID) ? 'H' : '-',
                                       (Finfo.fattrib & AM_SYS) ? 'S' : '-',
                                       (Finfo.fattrib & AM_ARC) ? 'A' : '-',
                                       (Finfo.fdate >> 9) + 1980, (Finfo.fdate >> 5) & 15, Finfo.fdate & 31,
                                       (Finfo.ftime >> 11), (Finfo.ftime >> 5) & 63, (INT)Finfo.fsize, Finfo.fname);
#if _USE_LFN

                                for (p2 = strlen(Finfo.fname); p2 < 14; p2++)
                                    printf(" ");

                                printf("%s\n", Lfname);
#else
                                printf("\n");
#endif
                            }

                            printf("%4d File(s),%10d bytes total\n%4d Dir(s)", s1, (INT)p1, s2);

                            if (f_getfree(ptr, (DWORD *)&p1, &fs) == FR_OK)
                                printf(", %10d bytes free\n", (INT)(p1 * fs->csize * 512));

                            break;


                        case 'o' :  /* fo <mode> <file> - Open a file */
                            if (!xatoi(&ptr, &p1)) break;

                            while (*ptr == ' ') ptr++;

                            put_rc(f_open(&file1, ptr, (BYTE)p1));
                            break;

                        case 'c' :  /* fc - Close a file */
                            put_rc(f_close(&file1));
                            break;

                        case 'e' :  /* fe - Seek file pointer */
                            if (!xatoi(&ptr, &p1)) break;

                            res = f_lseek(&file1, p1);
                            put_rc(res);

                            if (res == FR_OK)
                                printf("fptr=%d(0x%X)\n", (INT)file1.fptr, file1.fptr);

                            break;

                        case 'd' :  /* fd <len> - read and dump file from current fp */
                            if (!xatoi(&ptr, &p1)) break;

                            ofs = file1.fptr;

                            while (p1)
                            {
                                if ((UINT)p1 >= 16)
                                {
                                    cnt = 16;
                                    p1 -= 16;
                                }
                                else
                                {
                                    cnt = p1;
                                    p1 = 0;
                                }

                                res = f_read(&file1, Buff, cnt, &cnt);

                                if (res != FR_OK)
                                {
                                    put_rc(res);
                                    break;
                                }

                                if (!cnt) break;

                                put_dump(Buff, ofs, cnt);
                                ofs += 16;
                            }

                            break;

                        case 'r' :  /* fr <len> - read file */
                            if (!xatoi(&ptr, &p1)) break;

                            p2 = 0;
                            timer_init();

                            while (p1)
                            {
                                if ((UINT)p1 >= blen)
                                {
                                    cnt = blen;
                                    p1 -= blen;
                                }
                                else
                                {
                                    cnt = p1;
                                    p1 = 0;
                                }

                                res = f_read(&file1, Buff, cnt, &s2);

                                if (res != FR_OK)
                                {
                                    put_rc(res);
                                    break;
                                }

                                p2 += s2;

                                if (cnt != s2) break;
                            }

                            p1 = get_timer_value();

