OpenNuvoton/M55M1BSP/SampleCode/StdDriver/HSUSBH_USBH_VCOM_MassStorage/main.c
                            if (p1)
                                printf("%d bytes read with %d kB/sec.\n", (INT)p2, (INT)(((p2 * 100) / p1) / 1024));

                            break;

                        case 'w' :  /* fw <len> <val> - write file */
                            if (!xatoi(&ptr, &p1) || !xatoi(&ptr, &p2)) break;

                            memset(Buff, (BYTE)p2, blen);

                            p2 = 0;
                            timer_init();

                            while (p1)
                            {
                                if ((UINT)p1 >= blen)
                                {
                                    cnt = blen;
                                    p1 -= blen;
                                }
                                else
                                {
                                    cnt = p1;
                                    p1 = 0;
                                }

                                res = f_write(&file1, Buff, cnt, &s2);

                                if (res != FR_OK)
                                {
                                    put_rc(res);
                                    break;
                                }

                                p2 += s2;

                                if (cnt != s2) break;
                            }

                            p1 = get_timer_value();

                            if (p1)
                                printf("%d bytes written with %d kB/sec.\n", (INT)p2, (INT)(((p2 * 100) / p1) / 1024));

                            break;

                        case 'n' :  /* fn <old_name> <new_name> - Change file/dir name */
                            while (*ptr == ' ') ptr++;

                            ptr2 = strchr(ptr, ' ');

                            if (!ptr2) break;

                            *ptr2++ = 0;

                            while (*ptr2 == ' ') ptr2++;

                            put_rc(f_rename(ptr, ptr2));
                            break;

                        case 'u' :  /* fu <name> - Unlink a file or dir */
                            while (*ptr == ' ') ptr++;

                            put_rc(f_unlink(ptr));
                            break;

                        case 'v' :  /* fv - Truncate file */
                            put_rc(f_truncate(&file1));
                            break;

                        case 'k' :  /* fk <name> - Create a directory */
                            while (*ptr == ' ') ptr++;

                            put_rc(f_mkdir(ptr));
                            break;

                        case 'a' :  /* fa <atrr> <mask> <name> - Change file/dir attribute */
                            if (!xatoi(&ptr, &p1) || !xatoi(&ptr, &p2)) break;

                            while (*ptr == ' ') ptr++;

                            put_rc(f_chmod(ptr, p1, p2));
                            break;

                        case 't' :  /* ft <year> <month> <day> <hour> <min> <sec> <name> - Change timestamp */
                            if (!xatoi(&ptr, &p1) || !xatoi(&ptr, &p2) || !xatoi(&ptr, &p3)) break;

                            Finfo.fdate = (WORD)(((p1 - 1980) << 9) | ((p2 & 15) << 5) | (p3 & 31));

                            if (!xatoi(&ptr, &p1) || !xatoi(&ptr, &p2) || !xatoi(&ptr, &p3)) break;

                            Finfo.ftime = (WORD)(((p1 & 31) << 11) | ((p1 & 63) << 5) | ((p1 >> 1) & 31));
                            put_rc(f_utime(ptr, &Finfo));
                            break;

                        case 'x' : /* fx <src_name> <dst_name> - Copy file */
                            while (*ptr == ' ') ptr++;

                            ptr2 = strchr(ptr, ' ');

                            if (!ptr2) break;

                            *ptr2++ = 0;

                            while (*ptr2 == ' ') ptr2++;

                            printf("Opening \"%s\"", ptr);
                            res = f_open(&file1, ptr, FA_OPEN_EXISTING | FA_READ);
                            printf("\n");

                            if (res)
                            {
                                put_rc(res);
                                break;
                            }

                            printf("Creating \"%s\"", ptr2);
                            res = f_open(&file2, ptr2, FA_CREATE_ALWAYS | FA_WRITE);
                            putchar('\n');

                            if (res)
                            {
                                put_rc(res);
                                f_close(&file1);
                                break;
                            }

                            printf("Copying...");
                            p1 = 0;

                            for (;;)
                            {
                                res = f_read(&file1, Buff, BUFF_SIZE, &s1);

                                if (res || s1 == 0) break;   /* error or eof */

                                res = f_write(&file2, Buff, s1, &s2);
                                p1 += s2;

                                if (res || s2 < s1) break;   /* error or disk full */

                                if ((p1 % 0x10000) == 0)
                                    printf("\n%d KB copyed.", (INT)(p1 / 1024));

                                printf(".");
                            }

                            printf("\n%d bytes copied.\n", (INT)p1);
                            f_close(&file1);
                            f_close(&file2);
                            break;

                        case 'y' : /* fz <src_name> <dst_name> - Compare file */
                            while (*ptr == ' ') ptr++;

                            ptr2 = strchr(ptr, ' ');

                            if (!ptr2) break;

                            *ptr2++ = 0;

                            while (*ptr2 == ' ') ptr2++;

                            printf("Opening \"%s\"", ptr);
                            res = f_open(&file1, ptr, FA_OPEN_EXISTING | FA_READ);
                            printf("\n");

