OpenNuvoton/M55M1BSP/SampleCode/StdDriver/HSUSBH_USBH_VCOM_MassStorage/main.c
                            if (res)
                            {
                                put_rc(res);
                                break;
                            }

                            printf("Opening \"%s\"", ptr2);
                            res = f_open(&file2, ptr2, FA_OPEN_EXISTING | FA_READ);
                            putchar('\n');

                            if (res)
                            {
                                put_rc(res);
                                f_close(&file1);
                                break;
                            }

                            printf("Compare...");
                            p1 = 0;

                            for (;;)
                            {
                                res = f_read(&file1, Buff, BUFF_SIZE, &s1);

                                if (res || s1 == 0)
                                {
                                    printf("\nRead file %s terminated. (%d)\n", ptr, res);
                                    break;     /* error or eof */
                                }

                                res = f_read(&file2, Buff2, BUFF_SIZE, &s2);

                                if (res || s2 == 0)
                                {
                                    printf("\nRead file %s terminated. (%d)\n", ptr2, res);
                                    break;     /* error or eof */
                                }

                                p1 += s2;

                                if (res || s2 < s1) break;   /* error or disk full */

                                if (memcmp(Buff, Buff2, s1) != 0)
                                {
                                    printf("Compre failed!! %d %d\n", s1, s2);
                                    break;
                                }

                                if ((p1 % 0x10000) == 0)
                                    printf("\n%d KB compared.", (INT)(p1 / 1024));

                                printf(".");
                            }

                            if (s1 == 0)
                                printf("\nPASS. \n ");

                            f_close(&file1);
                            f_close(&file2);
                            break;

#if _FS_RPATH

                        case 'g' :  /* fg <path> - Change current directory */
                            while (*ptr == ' ') ptr++;

                            put_rc(f_chdir(ptr));
                            break;

                        case 'j' :  /* fj <drive#> - Change current drive */
                            while (*ptr == ' ') ptr++;

                            dump_buff_hex((uint8_t *)&p1, 16);
                            put_rc(f_chdrive((TCHAR *)ptr));
                            break;
#endif
#if _USE_MKFS

                        case 'm' :  /* fm <partition rule> <sect/clust> - Create file system */
                            if (!xatoi(&ptr, &p2) || !xatoi(&ptr, &p3)) break;

                            printf("The memory card will be formatted. Are you sure? (Y/n)=");
                            get_line(ptr, sizeof(Line));

                            if (*ptr == 'Y')
                                put_rc(f_mkfs(0, (BYTE)p2, (WORD)p3));

                            break;
#endif

                        case 'z' :  /* fz [<rw size>] - Change R/W length for fr/fw/fx command */
                            if (xatoi(&ptr, &p1) && p1 >= 1 && (size_t)p1 <= BUFF_SIZE)
                                blen = p1;

                            printf("blen=%d\n", blen);
                            break;
                    }

                    break;

                case '?':       /* Show usage */
                    printf(
                        _T("n: - Change default drive (USB drive is 3~7)\n")
                        _T("dd [<lba>] - Dump sector\n")
                        //_T("ds <pd#> - Show disk status\n")
                        _T("\n")
                        _T("bd <ofs> - Dump working buffer\n")
                        _T("be <ofs> [<data>] ... - Edit working buffer\n")
                        _T("br <pd#> <sect> [<num>] - Read disk into working buffer\n")
                        _T("bw <pd#> <sect> [<num>] - Write working buffer into disk\n")
                        _T("bf <val> - Fill working buffer\n")
                        _T("\n")
                        _T("fs - Show volume status\n")
                        _T("fl [<path>] - Show a directory\n")
                        _T("fo <mode> <file> - Open a file\n")
                        _T("fc - Close the file\n")
                        _T("fe <ofs> - Move fp in normal seek\n")
                        //_T("fE <ofs> - Move fp in fast seek or Create link table\n")
                        _T("fd <len> - Read and dump the file\n")
                        _T("fr <len> - Read the file\n")
                        _T("fw <len> <val> - Write to the file\n")
                        _T("fn <object name> <new name> - Rename an object\n")
                        _T("fu <object name> - Unlink an object\n")
                        _T("fv - Truncate the file at current fp\n")
                        _T("fk <dir name> - Create a directory\n")
                        _T("fa <atrr> <mask> <object name> - Change object attribute\n")
                        _T("ft <year> <month> <day> <hour> <min> <sec> <object name> - Change timestamp of an object\n")
                        _T("fx <src file> <dst file> - Copy a file\n")
                        _T("fg <path> - Change current directory\n")
                        _T("fj <ld#> - Change current drive. For example: <fj 4:>\n")
                        _T("fm <ld#> <rule> <cluster size> - Create file system\n")
                        _T("\n")
                    );
                    break;
            }
        }
    }

    //while(1);
}


/*** (C) 2023 Nuvoton Technology Corp. All rights reserved. ***/
